export const typeArr = ['전체', '월세', '전세', '전월세'];

export const yearArr = [
  '전체',
  '2022년 이후',
  '2021년 이후',
  '2020년 이후',
  '2019년 이후',
  '2018년 이후',
  '2017년 이후',
  '2016년 이후',
  '2015년 이후',
  '2014년 이후',
  '2013년 이후',
  '2012년 이후',
  '2011년 이후',
  '2010년 이후',
  '2009년 이후',
  '2008년 이후',
  '2008년 이전',
];
export const parkingNumArr = [
  '전체',
  '1대',
  '1대 ~ 2대',
  '2대',
  '2대 ~ 3대',
  '3대',
  '3대 ~ 4대',
  '4대',
  '4대 ~ 5대',
  '5대 이상',
];
export const plusFilter = [
  '건물사진 있음',
  '내부사진 있음',
  '동영상 있음',
  '관리비포함',
  '현재공실',
  '금액네고',
];
export const roomCount = [
  '전체',
  '1개',
  '1.5개',
  '1~2개',
  '2개',
  '2~3개',
  '3개',
  '3~4개',
  '4개',
  '4~5개',
  '5개 이상',
];
export const roomType = ['전체', '오픈형', '분리형', '복층형', '원룸원거실', '세미분리형'];

export const floorType = ['전체', '지상', '지하', '반지하', '옥탑', '단독'];
export const livingRoomSize = ['전체', '거실(대)', '거실(중)', '거실(소)'];
export const plusFilterNormal = [
  '건물사진 있음',
  '내부사진 있음',
  '동영상 있음',
  '단기임대',
  '관리비포함',
  '주차가능',
  '현재공실',
  '베란다',
  '풀옵션제외',
  '풀옵션만보기',
  'E/V',
  '금액네고',
  '전세대출가능',
  '애완동물가능',
];
