import React from 'react';
import styled from '@/style';
import { Link } from 'react-router-dom';

const TermsOfUseWrap = styled.div`
  width: 485px;
  height: 350px;
  overflow-y: scroll;
  border: 1px solid #888f91;
  padding: 10px;
  line-height: 150%;
  color: #464d50;
  font-size: 13px;
`;
const Title = styled.strong`
  display: block;
  margin-bottom: 10px;
`;
const Text = styled.div`
  margin-bottom: 40px;
`;

const TermsOfUseCp = () => {
  return (
    <TermsOfUseWrap>
      <Title>제1조(목적)</Title>
      <Text>
        이 이용약관(이하 “약관”)은 ㈜프롭라인(이하 “회사”라 함)과 이용고객(이하 “회원”)간에 회사가 제공하는
        서비스의 가입조건 및 이용에 관한 제반 사항과 기타 필요한 사항을 구체적으로 규정함을 목적으로 합니다.
      </Text>
      <Title>제2조 (약관의 효력 및 변경)</Title>
      <Text>
        (1) 본 약관은 서비스를 이용하고자 하는 모든 회원에 대해서 그 효력이 발생합니다.
        <br />
        <br />
        (2) 본 약관의 내용은 서비스의 홈페이지 또는 서비스 화면에 게시하거나 기타의 방법으로 회사가 회원에게
        공지하고, 회원이 이에 동의함으로써 효력이 발생합니다.
        <br />
        <br />
        (3) 회사는 서비스와 회원에게 필요하다고 인정되는 경우 약관을 변경할 수 있습니다. 약관을 개정할 경우
        개정 사유 및 적용 일자를 명시하여 현행 약관과 함께 적용 일자 7일 전부터 적용일 전날까지 제2항의
        방법으로 공지합니다. 다만, 회원에게 불리하거나 회원의 권리 또는 의무에 관한 중요 사항의 변경은 최소
        30일 전에 공지하고 E-mail을 통해 회원에게 개별 통지합니다. (회원의 연락처 미기재, 변경 등으로 인하여
        개별 통지가 어려운 때에만 홈페이지에 변경 약관을 공지함으로써 개별 통지한 것으로 간주합니다.)
        <br />
        <br />
        (4) 회사가 전 항에 따라 공지 또는 통지를 하면서 공지 또는 통지일로부터 개정약관 시행일 7일 후까지 거부
        의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도 여러분의 의사 표시가 없는
        경우에는 변경된 약관을 승인한 것으로 봅니다. 여러분이 개정약관에 동의하지 않을 경우 이용계약을 해지할
        수 있습니다.
        <br />
        <br />
        (5) 본 약관에 동의하는 것은 회사가 운영하는 서비스의 홈페이지를 정기적으로 방문하여 약관의 변경사항을
        확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대하여
        회사는 책임이 없습니다.
      </Text>
      <Title>제3조 (약관 외 준칙)</Title>
      <Text>
        (1) 이 약관에 명시되지 않은 사항은 “정보통신망 이용촉진 및 정보보호 등에 관한 법률”, “약관의 규제에
        관한 법률”, “전기통신사업법” 등 관계 법령 및 회사가 정한 서비스의 이용약관, 운영정책 등 내부 규정에
        따릅니다.
      </Text>
      <Title>제4조 (용어의 정의)</Title>
      <Text>
        이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
        <br />
        <br />
        (1) 회사라 함은 웹사이트를 기반으로 콘텐츠 및 제반 서비스를 제공하는 자를 말합니다.
        <br />
        <br />
        (2) 이용자라 함은 회사의 웹사이트에서 게재 및 제공되는 콘텐츠 및 서비스를 이용하는 회원 및 비회원을
        말합니다.
        <br />
        <br />
        (3) 회원이라 함은 이 약관에 동의하고, 회사가 부여한 이용자 아이디, 비밀번호를 보유한 자로서 이
        웹사이트에서 제공되는 정보 및 서비스를 지속적으로 이용할 수 있는 자를 말합니다.
        <br />
        <br />
        (4) 비회원이라 함은 회원에 가입하지 않고, 회사의 웹사이트에서 제공되는 콘텐츠 및 서비스를 이용하는
        자를 말합니다.
        <br />
        <br />
        (5) 콘텐츠라 함은 정보통신망 이용촉진 및 정보보호 등에 관한 법률 제3조 제1항의 규정에 의한
        정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보로서 그
        보존 및 이용에 있어서 효용을 높일 수 있도록 전자적 형태로 제작 또는 처리된 것을 말합니다.
        <br />
        <br />
        (6) 서비스라 함은 회사가 제공하는 공실 정보, 부동산 매물 등 이용자에게 전자적으로 제공하는 용역 및
        온라인/오프라인 서비스를 의미합니다. 이용자가 일정 금액을 지불하는 경우 그 지급 금액에 따라 이용할 수
        있는 콘텐츠가 제공됩니다.
        <br />
        <br />
        (7) 아이디라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하거나 관리자가 승인하는 문자 또는
        숫자의 조합을 말합니다.
        <br />
        <br />
        (8) 비밀번호라 함은 회원이 부여받은 아이디와 일치되는 회원임을 확인하고 비밀 호를 위해 회원 자신이
        정한 문자 또는 숫자의 조합을 말합니다.
        <br />
        <br />
        (9) 해지라 함은 회사 또는 회원이 서비스 개통 후 이용 계약을 해약하는 것을 말합니다.
        <br />
        <br />
        (10) 제휴사이트라 함은 회사가 업무제휴를 통해 공동 마케팅, 공동 사업 등을 추진하기 위하여
        하이퍼링크방식(하이퍼링크의 대상에는 문자, 정지 및 동화상 등이 포함됨) 등으로 연결한 업무제휴 사업체의
        웹 사이트를 말합니다.
        <br />
        <br />
        (11) 전항에서 정한 것을 제외하고는 거래 관행 및 관계 법령에 따릅니다.
      </Text>
      <Title>제5조 (회원가입)</Title>
      <Text>
        (1) 회원가입은 이용자가 약관의 내용에 대하여 동의를 하고 회원가입 신청을 한 후 회사가 이러한 신청에
        대하여 승낙함으로써 체결됩니다.
        <br />
        <br />
        (2) 회원가입 시 회사가 정한 양식에 따라 회원 정보를 기재하여야 하며, 회원 정보는 필수 입력사항과 선택
        입력사항으로 구분됩니다. 필수 입력사항은 회원가입 양식에 별도 표시하여 안내하며, 입력하지 아니한 경우
        회원가입 신청은 거절될 수 있습니다.
        <br />
        <br />
        (3) 회사는 상기 이용자의 신청에 대하여 회원가입을 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각호에
        해당하는 신청에 대하여는 승낙을 거부할 수 있습니다.
        <br />
        <br />
        ① 가입 신청자가 법령 또는 약관을 위반하여 이전에 회원자격을 박탈한 경우
        <br />
        ② 중개회원 가입 신청 시 관련 법령에 따라 유효하게 등록된 부동산중개사무소가 아닌 경우
        <br />
        ③ 등록 신청 내용에 허위, 기재누락, 오기가 있는 경우
        <br />
        ④ 허위의 정보를 기재하거나 회사가 제시하는 내용을 기재하지 않은 경우
        <br />
        ⑤ 실명이 다르거나 다른 사업자 명의를 이용하는 경우
        <br />
        ⑥ 이용자의 귀책 사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하여 신청하는 경우
        <br />
        ⑦ 부정한 목적 또는 용도로 이 서비스를 이용하고자 하는 경우
        <br />
        <br />
        (4) 회사는 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우에는 그 사유가 해소될
        때까지 승낙을 유보할 수 있습니다.
        <br />
        <br />
        (5) 회원가입 신청의 승낙을 하지 아니하거나 유보한 경우, 회사는 이를 신청자에게 알려야 합니다. 다만,
        회사의 귀책 사유 없이 신청자에게 통지할 수 없는 경우에는 예외로 합니다.
        <br />
        <br />
        (6) 회원 아이디는 회원 본인의 동의 하에 회사가 운영하는 사이트와 회원 아이디와 연결될 수 있습니다.
        <br />
        <br />
        (7) 이용자 아이디 및 비밀번호의 관리책임은 이용자에게 있습니다. 이를 소홀히 관리하여 발생하는 서비스
        이용상의 손해 또는 제삼자에 의한 부정 이용 등에 대한 책임은 이용자에게 있으며, 회사는 그에 대한 책임을
        일체 지지 않습니다.
      </Text>
      <Title>제6조 (회사의 의무)</Title>
      <Text>
        (1) 회사는 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 약관이 정하는 바에 따라 회원에게
        안정적인 서비스를 제공하기 위해 최선을 다합니다.
        <br />
        <br />
        (2) 회사는 회원 상호 간의 거래에 있어서 어떠한 보증도 제공하지 않습니다.
        <br />
        <br />
        (3) 회사는 이용계약의 체결, 계약사항의 변경 및 해지 등 회원과의 계약 관계절차 및 내용 등에 있어
        회원에게 편의를 제공하도록 노력합니다.
      </Text>
      <Title>제7조 (회원의 의무)</Title>
      <Text>
        (1) 회원은 다음 각호의 행위를 하여서는 안 됩니다. 만약 다음 각호와 같은 행위가 확인되면 회사는 해당
        회원에게 서비스 이용에 대한 제재를 가할 수 있습니다.
        <br />
        <br />
        ① 회사의 서비스 운영을 고의 또는 과실로 방해하는 경우
        <br />
        ② 신청 또는 변경 시 허위내용의 등록
        <br />
        ③ 타인의 정보 도용 및 허위 매물 정보 등록
        <br />
        ④ 의뢰인(소유주 또는 세입자로 회원에게 해당 매물에 대한 중개를 의뢰한 자)로부터 개인정보 수집 이용 및
        제 삼자 제공 등에 대해 동의를 얻지 않은 매물 정보의 등록
        <br />
        ⑤ 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
        <br />
        ⑥ 회사 및 기타 제삼자의 명예를 손상시키거나 업무를 방해하는 행위
        <br />
        ⑦ 사기 및 악성 글 등록 등 건전한 거래 문화 활성에 방해되는 행위
        <br />
        ⑧ 이용자가 서비스 이용을 위해 제공한 모든 종류의 개인정보를 이용자의 이용 목적 외에 이용하거나
        제삼자에게 제공하는 경우
        <br />
        <br />
        (2) 회원은 관계법, 이 약관 및 운영정책 규정, 이용 안내 및 부동산정보서비스와 관련하여 공지한 주의사항
        등 회사가 통지하는 사항을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안 됩니다.
      </Text>
      <Title>제8조 (유료상품의 제공)</Title>
      <Text>
        (1) 서비스를 이용하기 위하여 필요한 이용 요금제 결제, 포인트 충전, 사용, 환불 등과 관련한 “회사와
        회원이 준수하여야 할 사항을 규정함”을 목적으로 합니다.
        <br />
        <br />
        (2) 회사는 유료상품 서비스에 대한 이용 자격 제한을 둘 수 있으며, 구체적인 자격 제한 요건을 별도
        공지합니다.
        <br />
        <br />
        (3) 유료상품을 구매한 회원은 유료상품 결제 이용약관에 동의하고 서비스 이용료를 결제함으로써 서비스
        이용이 가능합니다.
      </Text>
      <Title>제9조 (매물관리센터 서비스 제공)</Title>
      <Text>
        (1) 회원은 매물관리센터를 통해 매물정보를 등록, 관리, 수정, 삭제할 수 있습니다.
        <br />
        <br />
        (2) 회사는 회원이 등록한 매물정보에 “사단법인 한국인터넷자율정책기구 산하 부동산매물검증센터” 에 매물
        검증을 의뢰할 수 있으며, 매물검증과정에서 검증실패 처리된 매물정보에 대하여 회원에게 매물정보 수정을
        요청하거나 매물정보 노출을 거부할 수 있습니다.
        <br />
        <br />
        (3) 회사는 회원이 부동산매물검증센터 정책에 따른 허위매물관리 규정 등을 이행하지 않거나 위반할 경우
        유선상의 통지 또는 시정을 요구할 수 있습니다. (경매매물 및 허위매물 등록 등)
        <br />
        <br />
        (4) 사이트에 노출되는 매물정보에 대한 노출 정책(노출 순서, 노출 기간, 노출 영역 등)의 지정, 변경, 추가
        등에 대해서는 회사가 모든 권한을 가집니다.
        <br />
        <br />
        (5) 회사는 회원별로 제휴사에 대한 매물정보 제공 동의를 받은 후 해당 매물정보를 제휴사에 제공할 수
        있으며, 제휴사의 제공된 매물정보는 제휴사의 매물 노출 정책에 따라 제휴사이트에 노출됩니다.
        <br />
        <br />
        (6) 회사는 “사단법인 한국인터넷자율정책기구” 로부터 허위매물로 확인된 매물정보에 대하여 회원에게
        별도로 정한 “허위매물처리 규정” 에 따라 해당 회원의 회원 권한 및 사이트 서비스 이용을 제한할 수
        있습니다.
      </Text>
      <Title>제10조 (공실매물 서비스 제공)</Title>
      <Text>
        (1) 임대인(건물주 또는 의뢰인)은 매물을 사이트에 등록(광고) 또는 유선상의 의뢰를 통해 연락처를
        제공합니다.
        <br />
        <br />
        (2) 임대인(건물주) 매물 등록은 회사의 중개회원에게 중개 수수료를 지급할 의사가 있는 매물이어야 하며,
        수수료율은 임대인(건물주)과 중개회원, 즉 계약 당사 간의 협의를 통해 조정하는 것을 원칙으로 합니다.
        <br />
        <br />
        (3) 회사는 중개 수수료와 관련한 분쟁 및 법적 책임을 지지 않습니다.
        <br />
        <br />
        (4) 회사는 수집된 매물정보를 제휴사 광고 및 네이버 부동산 광고 전송에 활용할 수 있습니다.
        <br />
        <br />
        (5) 등록된 공실매물이 허위매물 또는 과장 광고로 판명될 경우 매물 의뢰인의 사전 동의 없이 회사에 의해
        삭제될 수 있으며, 서비스 이용이 제한될 수 있습니다.
      </Text>
      <Title>제11조 (서비스의 내용)</Title>
      <Text>
        (1) 회사는 제 4조 6항의 서비스를 제공할 수 있으며 그 내용은 다음 각호와 같습니다.
        <br />
        <br />
        ① 공실 정보 등록과 조회 서비스
        <br />
        ② 공실 정보 조회와 관련된 제한 서비스
        <br />
        ③ 부동산 매물 전송 서비스(네이버 매물관리센터)
        <br />
        ④ 이용자 간의 교류와 소통에 관련한 서비스
        <br />
        ⑤ 기타 회사가 추가 개발하거나 제휴 계약 등을 통해 회원에게 제공하는 일체의 서비스
        <br />
        <br />
        (2) 회사는 필요한 경우 서비스의 내용을 변경 또는 추가할 수 있습니다.
      </Text>
      <Title>제12조 (이용계약의 종료)</Title>
      <Text>
        (1) 회원의 해지
        <br />
        <br />
        ① 회원은 언제든지 회사에 해지 의사를 통지할 수 있고 회사는 특별한 사유가 없는 한 이를 즉시 수락하여야
        합니다. 다만, 회원은 해지 의사를 통지하기 전에 모든 진행 중인 절차를 완료, 철회 또는 취소해야만
        합니다. 이 경우 철회 또는 취소로 인한 불이익은 회원 본인이 부담하여야 합니다.
        <br />
        ② 회원이 발한 의사표시로 인해 발생한 불이익에 대한 책임은 회원 본인이 부담하여야 하며, 이용계약이
        종료되면 회사는 회원에게 부가적으로 제공한 각종 혜택을 회수할 수 있습니다.
        <br />
        ③ 회원의 의사로 이용계약을 해지한 후 추후 재이용을 희망할 때 재이용 의사가 회사에 통지되고 이에 대한
        회사의 승낙이 있는 경우에만 서비스 재이용이 가능합니다.
        <br />
        ④ 본 항에 따라 해지를 한 회원은 이 약관이 정하는 회원가입 절차와 관련 조항에 따라 신규 회원으로 다시
        가입할 수 있습니다. 다만 회원이 중복참여가 제한된 판촉이벤트 중복 참여 등 부정한 목적으로 회원탈퇴 후
        재이용을 신청하는 경우 회사는 가입을 일정 기간 제한할 수 있습니다.
        <br />
        ⑤ 본 항에 따라 해지를 한 이후에는 재가입이 불가능하며, 모든 가입은 신규가입으로 처리됩니다.
        <br />
        <br />
        (2) 회사의 해지 회사는 다음과 같은 사유가 발생하거나 확인된 경우 이용계약을 해지할 수 있습니다.
        <br />
        <br />
        ① 다른 회원의 권리나 명예, 신용 기타 정당한 이익을 침해하거나 대한민국 법령 또는 공서양속에 위배되는
        행위를 한 경우
        <br />
        ② 회사가 제공하는 서비스의 원활한 진행을 방해하는 행위를 하거나 시도한 경우
        <br />
        ③ 제5조 제3항의 승낙거부 사유가 추후 발견된 경우
        <br />
        ④ 회사가 정한 서비스 운영정책을 이행하지 않거나 위반한 경우
        <br />
        ⑤ 기타 회사가 합리적인 판단을 근거로 하여 서비스의 제공을 거부할 필요가 있다고 인정한 경우
        <br />
        <br />
        (3) 회사가 해지하는 경우 회사는 회원에게 이메일, 전화, 기타의 방법을 통하여 해지사유를 밝혀 해지
        의사를 통지합니다. 이용계약은 회사의 해지 의사를 회원에게 통지한 시점에 종료됩니다.
        <br />
        <br />
        (4) 본 항에서 정한 바에 따라 이용계약이 종료될 시에는 회사는 회원에게 부가적으로 제공한 각종 혜택을
        회수할 수 있습니다. 이용계약의 종료와 관련하여 발생한 손해는 이용계약이 종료된 해당 회원이 책임을
        부담하여야 하고, 회사는 일체의 책임을 지지 않습니다.
        <br />
        <br />
        (5) 본 항에서 정한 바에 따라 이용계약이 종료된 경우에는 회원의 재이용 신청에 대하여 회사는 이에 대한
        승낙을 거절할 수 있습니다.
        <br />
        <br />
        (6) “회원”이 계약을 해지하는 경우, 관련법 및 개인정보 취급방침에 따라 “회사”가 “회원” 정보를 보유하는
        경우를 제외하고는 해지 즉시 “회원”의 모든 데이터는 소멸됩니다.
      </Text>
      <Title>제13조 (서비스 결제 및 환불)</Title>
      <Text>
        (1) 회원은 회사가 제공하는 다양한 결제수단을 통해 유료 서비스를 이용할 수 있으며, 결제가 비상적으로
        처리되어 정상처리를 요청할 경우 회사는 회원의 결제금액을 정상 처리할 의무를 가집니다.
        <br />
        <br />
        (2) 회사는 회원이 부정한 방법 또는 회사가 금지한 방법을 행할 경우 결제된 금액에 대해서 취소 및
        환불처리가 가능하며, 서비스 이용을 제한할 수 있습니다.
        <br />
        <br />
        (3) 접수 계좌 오류, 증빙서류 미접수 등의 사유로 환불이 유보 또는 지연될 수 있으며, 잘못된 환불 계좌
        또는 증빙서류를 접수하여 발생하는 문제에 대하여 회사는 책임지지 않습니다.
        <br />
        <br />
        (4) 이벤트로 지급된 상품은 환불금액에서 제외됩니다.
        <br />
        <br />
        (5) 수수료를 제한 나머지 금액이 없을 경우 환불이 불가능합니다.
        <br />
        <br />
        (6) 환불 금액은 접수해주신 일자에서 영업일 기준 3일 이내에 입금됩니다.
        <br />
        <br />
        (7) 회원은 다음 각호의 사유가 있을 경우 규정에 따라서 회사로부터 결제 취소, 환불을 받을 수 있습니다.
        <br />
        <br />
        ① 환불 규정 등은 “약관의 규제에 관한 법률”,“전자상거래 등에서의 소비자보호에 관한 법률”,“온라인 디지털
        콘텐츠 사업 발전법” 등을 반영하였으며 위 관계 법령에 위배되는 부분이 있는 경우 위 관계 법령의 내용을
        따르며, 홈페이지에 별도로 서비스의 환불 규정에 대한 안내를 게시합니다.
        <br />
        ② 회사가 회원에게 결제금액을 환불해주었을 때는 원칙적으로 회원이 결제한 때와 동일한 수단으로
        환급합니다. 다만 동일한 수단으로 환불이 불가능한 경우에는 그 사유와 다른 수단을 통해 처리할 수
        있습니다.
        <br />
        ③ 부가적으로 제공받은 상품, 기간의 경우 환불이 불가능합니다.
        <br />
        ④ 기타 특별한 조건에 따른 이벤트성 유료 서비스 등은 별도의 환불 규정이 적용될 수 있습니다.
        <br />
        <br />
        (8) 취소, 환불 규정은 아래 사항과 같습니다.
        <br />
        <br />
        ① 취소, 변경 불가 상품은 규정과 상관없이 취소, 변경이 불가능합니다.
        <br />
        ② 회원 단순 변심에 의한 취소 및 환불일 경우 처리에 발생하는 수수료는 회원이 부담합니다.
        <br />
        ③ 환불 기간은 취소 요청일로부터 3일 이내(영업일 기준)에 처리되며, 주말 및 공휴일일 경우 다음 영업일에
        환불 처리됩니다.
        <br />
        ④ 실제 이용 기간을 제외한 나머지 잔여기간만 해당 결제금액을 일할 계산한 일부 금액이 환불됩니다.
        (결제금의 80%)
        <br />
        ⑤ 정상가에서 할인된 가격으로 구매하였을 시 사용 기간만큼 정시가로 일할 계산하여 할인된 구매가격의
        나머지 잔액이 환불 처리됩니다.
        <br />
        ⑥ 카드사에 따라 환급 방법과 환급일은 다소 차이가 있을 수 있으며, 주말 및 공휴일일 경우 다음 영업일에
        처리됩니다.
        <br />
        <br />
        (9) 환불 신청 방법은 아래 사항과 같습니다.
        <br />
        <br />
        ① 공실클럽 고객센터(1644-5510, 내선번호 2번)로 전화 신청합니다.
        <br />② 환불 신청 시 회사는 환불 사유와 환불 받을 은행/ 계좌번호/ 예금주 정보를 요청할 수 있습니다.
        (단, 예금주는 회원 본인이어야 하며 예금주가 회원 본인이 아닌 경우 증빙서류를 요청할 수 있습니다.)
      </Text>
      <Title>제14조 (서비스의 변경 및 제한)</Title>
      <Text>
        (1) 회사는 회사의 정책 및 운영의 필요상 서비스(개별 서비스 포함)를 변경하거나 중단할 수 있습니다. 이
        경우 홈페이지에 그 내용을 공지하거나 제2조 제3항에서 정한 방법으로 회원에게 통지하고 서비스를 변경하여
        제공하거나 중단할 수 있습니다.
        <br />
        <br />
        (2) 회사는 다음에 해당하는 경우, 서비스의 전부 또는 일부를 제한하거나 중단할 수 있습니다.
        <br />
        <br />
        ① 회원이 회사 영업을 방해하는 경우
        <br />
        ② 회원이 서비스를 이용함에 있어 법령을 위반하거나 회사의 이용약관 또는 서비스 이용 기준 등을 위반한
        경우
        <br />
        ③ 서비스용 설비 보수 등의 공사로 인해 부득이한 경우
        <br />
        ④ 제휴업체(BP)와의 계약 종료 등과 같은 회사 사정으로 인해 서비스를 유지할 수 없는 경우
        <br />
        ⑤ 전시, 천재지변, 국가비상사태 등 불가항력 사유가 있는 경우
        <br />
        ⑥ 새로운 서비스 제공 등 서비스의 정책 및 운영의 필요상 회사가 적절하다고 판단하는 경우
        <br />
        <br />
        (3) 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할
        수 있으며 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.
      </Text>
      <Title>제15조 (서비스 이용시간)</Title>
      <Text>
        (1) 서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로
        합니다. 단, 회사는 시스템 정기점검, 증설 및 교체를 위해 회사가 정한 날이나 시간에 서비스를 일시 중단할
        수 있으며, 예정되어 있는 작업으로 인한 서비스 일시 중단은 사이트를 통해 사전에 공지합니다.
        <br />
        <br />
        (2) 회사는 새로운 서비스로의 교체 등 회사가 적정하다고 판단하는 사유에 의하여 현재 제공되는 서비스
        전부 또는 일부를 제한하거나 중지할 수 있습니다.
        <br />
        <br />
        (3) 회사는 서비스를 상품별, 회원 유형(부동산 건물주/관리업체/세입자) 등에 따라 각 범위별 분할하여
        서비스 이용 가능 시간을 별도로 지정할 수 있습니다.
      </Text>
      <Title>제16조 (정보의 제공 및 광고의 게재)</Title>
      <Text>
        (1) 회사는 회원이 서비스 이용 시 필요하다고 인정되는 다양한 정보 및 광고에 대해서는 전자우편이나 서신
        우편, 문자메시지 등의 방법으로 회원에게 제공할 수 있으며, 회원은 관련법에 따른 거래 관련 정보 및 고객
        문의 등에 대한 답변 등을 제외한 정보 제공에 대하여 수신 거절이 가능합니다.
        <br />
        <br />
        (2) 회사는 서비스 운용과 관련하여 서비스 화면, 홈페이지, 전자우편 등에 광고 등을 게재할 수 있으며,
        회사는 서비스를 이용하고자 하는 회원이 광고 게재에 동의하는 것으로 간주합니다.
      </Text>
      <Title>제17조 (게시물의 관리 운영)</Title>
      <Text>
        (1) 회원이 작성한 게시물에 대한 모든 권리 및 책임은 이를 게시한 회원에게 있으며, 회사는 회원이
        게시하거나 등록하는 서비스의 내용물이 다음 각 항에 해당한다고 판단되는 경우 사전통지 없이 삭제할 수
        있습니다.
        <br />
        <br />
        ① 본 서비스 약관에 위배되거나 상용 또는 불법, 음란, 저속하다고 판단되는 게시물을 게시한 경우
        <br />
        ② 회사의 원활한 서비스 제공을 방해하거나 서비스 성격과 부합하지 않는 정보의 경우
        <br />
        ③ 다른 회원 또는 제 삼자를 비방하거나 중상모략으로 명예를 손상시키고 피해를 주는 내용인 경우
        <br />
        ④ 공공질서 및 미풍양속에 위반되는 내용인 경우
        <br />
        ⑤ 제 삼자의 저작권, 지적 재산권, 초상권 등 권리를 침해하는 내용인 경우
        <br />⑥ 광고, 홍보 등의 상업적인 내용 및 콘텐츠 내용과 관련 없는 경우
      </Text>
      <Title>제18조 (책임의 한계)</Title>
      <Text>
        (1) 회사는 무료로 제공하는 정보 및 서비스에 관하여 개인정보 취급방침 또는 관계 법령의 벌칙, 과태료
        규정 등 강행규정에 위배되지 않는 한 원칙적으로 손실과 손해에 대해 책임지지 않습니다.
        <br />
        <br />
        (2) 회사는 회원을 포함한 이용자의 귀책 사유로 인한 정보 및 서비스 이용의 장애에 관하여 책임지지
        않습니다.
        <br />
        <br />
        (3) 회사는 회원이 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여 회사의 고의적 과실이
        없는 한 책임지지 않습니다.
        <br />
        <br />
        (4) 회사는 공동중개, 공실매물, 중개 수수료 등 회원들 간의 분쟁에 대한 민.형사상의 문제를 책임지지
        않습니다. 또한 회원간 제삼자 간에 발생하는 부동산 거래 등에 대하여 회사는 어떠한 책임도 의무도
        부담하지 않습니다.
        <br />
        <br />
        (5) 회사는 회원이 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 회사의 고의 또는
        과실이 없는 한 책임을 지지 않습니다.
        <br />
        <br />
        (6) 회사는 매물정보를 등록한 회원에 의한 사기, 연락 불능 등으로 인하여 발생하는 어떠한 직접, 간접,
        부수적, 파생적, 징벌적 손해, 손실, 상해 등에 대하여 도덕적, 법적 책임을 부담하지 않습니다.
      </Text>
      <Title>제19조 (재판권 및 준거법)</Title>
      <Text>
        (1) 회사와 회원 간의 분쟁이 발생한 경우, 회사와 회원은 분쟁의 해결을 위해 성실히 협의합니다.
        <br />
        <br />
        (2) 이 약관에 명시되지 않은 사항은 상거래 관습에 따릅니다.
        <br />
        <br />
        (3) 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 회사의 본사 소재지를 관할하는 법원을 관할
        법원으로 합니다. (시행일) 본 약관은 2021년 05월 14일부터 적용됩니다.
      </Text>
    </TermsOfUseWrap>
  );
};

export default React.memo(TermsOfUseCp);
